#if 0
int Cn_PutC(unsigned chr);
/*
	現在のカーソル位置に文字chrを表示し、カーソル位置を一つ進める
	chr が 0～0xff までなら ANK, 0x100以上ならシフトＪＩＳとして全角を表示
	一部コントロールコードをサポート(0x0a,0x0d,0x08,0x09)
	正常文字なら 0 を、不適文字なら1を返す。
 */

int Cn_PutS(unsigned char *str);
/*
	現在のカーソル位置に文字列str を表示し、文字列の終わりの次にカーソル位置を
	進める。
	chr が 0～0xff までなら ANK, 0x100以上ならシフトＪＩＳとして全角を表示
	一部コントロールコードをサポート(0x0a,0x0d,0x08,0x09)
	正常文字なら 0 を、不適文字なら1を返す。
 */


void Cn_DosPutChr(void);
/*
	DOS ファンクション・コール 0x06 を用いたコンソールへの 1文字出力
	ESCシーケンスなど利用可だが、利用後、カーソル位置がライブラリ内の値がず
	れるので、カーソル位置を設定する手続き(Cn_DosGetPos(),Cn_PosXY等) で
	カーソル位置を合わせてやる必要がある。
 */

void Cn_DosPutStr(void);
/*
	DOS ファンクション・コール 0x06 を用いたコンソールへの文字列出力
	ESCシーケンスなど利用可だが、利用後、カーソル位置がライブラリ内の値がず
	れるので、カーソル位置を設定する手続き(Cn_DosGetPos(),Cn_PosXY等) で
	カーソル位置を合わせてやる必要がある。
 */

void Cn_TVRamMode(void);
/*
	PC88VA の0xA0000からの配置をテキストVRAM にする。
	98 モードでは何もしない。
 */

#endif

